// #ifndef __DEFINE_H__
// #define __DEFINE_H__
// #include "PID.h"
// #include "bsp_can.h"
// #include "motor_control.h"
// #include "main.h"
// /****************************************************
//   * 电机部分 BEGIN
// 	***************************************************
// 	*/
//   #define  Motor_Init() { \
//               motors[TR_MOTOR].target_speed = 1000.0f;  /* 右上电机1000rpm */ \
//               motors[BL_MOTOR].target_speed = 1000.0f;  /* 右下电机1000rpm */ \
//               motors[TL_MOTOR].target_speed = 1000.0f;  /* 左上电机1000rpm */ \
//               motors[LR_MOTOR].target_speed = 1000.0f;  /* 左下电机1000rpm */ \
//           } 
// /****************************************************
//   * 电机部分 END
// 	***************************************************
// 	*/

//     /****************************************************
// 	* PID部分 BEGIN
// 	***************************************************
// 	*/
// // C620电调搭配M3508电机速度环PID参数
// #define C620_M3508_SPEED_PID_PARA \
// { \
// 	.Kp         =  0.0045f, \
// 	.Ki         =  0.000f, \
// 	.Kd         =  0.001f, \
// 	.max_out    = 20.000f, \
// 	.max_Int    =  0.000f, \
// 	.last_error =  0.000f, \
// 	.Int_error  =  0.000f, \
// 	.time_const =  0.010f, \
// }// 分别对底盘4个电机实例化PID参数

// // 分别对底盘4个电机实例化PID参数
// PID_typedef launcher_speed_pid[4] = {
// 	C620_M3508_SPEED_PID_PARA, 
// 	C620_M3508_SPEED_PID_PARA, 
// 	C620_M3508_SPEED_PID_PARA, 
// 	C620_M3508_SPEED_PID_PARA
// };

// /****************************************************
// 	* PID部分 END
// 	***************************************************
// 	*/

// /****************************************************
// 	* ET16S遥控器部分 BEGIN
// 	***************************************************
// 	*/


    
    



// #endif
